using System.Windows;

[assembly: ThemeInfo(
    ResourceDictionaryLocation.None, //где расположены словари ресурсов конкретной темы
                                     //(используется, если ресурс не найден на странице,
                                     // или словари ресурсов приложения)
    ResourceDictionaryLocation.SourceAssembly //где находится общий словарь ресурсов
                                              //(используется, если ресурс не найден на странице,
                                              // приложение или любые словари ресурсов, специфичные для темы)
)]